Тестовая_база_ERP_14/src/Documents/РЭЙ_ЗаявлениеВБанкПС/РЭЙ_ЗаявлениеВБанкПС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РЭЙ_ЗаявлениеВБанкПС</name>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкНовый</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИногоОснованияЗакрытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.РЭЙ_ВидыОперацийЗаявлениеВБанк</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияПС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереоформленияПС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияПС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеСуммыКонтракта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактВЭД</name>
    <type>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаОкончанияНовая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактСуммаНовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеЗакрытияПС</name>
    <comment>Номер подпункта Инструкции ЦБ РФ от 16.08.2017 №181-И</comment>
    <type>
      <types>EnumRef.РЭЙ_ОснованияЗакрытияПС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПереоформленияПС</name>
    <comment>Номер подпункта Инструкции ЦБ РФ от 16.08.2017 №181-И</comment>
    <type>
      <types>EnumRef.РЭЙ_ОснованияПереоформленияПС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродлениеСрокаКонтракта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктИнструкцииЦБР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонУполномоченногоПС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченныйПС</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияИнойДокументДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияИнойДокументНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПаспортаСделок</name>
    <attributes>
      <name>ПаспортСделки</name>
      <type>
        <types>DocumentRef.РЭЙ_ПаспортСделки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыИныеОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзменениеКодовВидовОпераций</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодВОБанка</name>
      <type>
        <types>CatalogRef.РЭЙ_ВидыВалютныхОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>КодВООрганизации</name>
      <type>
        <types>CatalogRef.РЭЙ_ВидыВалютныхОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетныйДокумент</name>
      <type>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Enums/РЭЙ_ВидыОперацийЗаявлениеВБанк/РЭЙ_ВидыОперацийЗаявлениеВБанк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РЭЙ_ВидыОперацийЗаявлениеВБанк</name>
  <enumValues>
    <name>ЗакрытиеПаспортаСделки</name>
  </enumValues>
  <enumValues>
    <name>ПереоформлениеПаспортаСделки</name>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеВедомостиБанковскогоКонтроля</name>
  </enumValues>
  <enumValues>
    <name>пункт181_7_1_ВнесениеИзмененийВРаздел1ВБК</name>
    <comment>п.6.9, п.7.1, п.7.9 Инструкции от 16.08.2017 №181-И</comment>
  </enumValues>
  <enumValues>
    <name>пункт181_2_25_ИзменениеКодовВидовОпераций</name>
    <comment>п.2.25 Инструкции от 16.08.2017 №181-И</comment>
  </enumValues>
  <enumValues>
    <name>пункт181_17_4_ПредоставлениеВБК</name>
    <comment>п.17.4 Инструкции от 16.08.2017 №181-И</comment>
  </enumValues>
  <enumValues>
    <name>пункт181_6_1_СнятиеСУчетаКонтракта</name>
    <comment>п/п.6.1.1-6.1.6 Инструкции от 16.08.2017 №181-И</comment>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/РЭЙ_ОснованияЗакрытияПС/РЭЙ_ОснованияЗакрытияПС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РЭЙ_ОснованияЗакрытияПС</name>
  <enumValues>
    <name>пункт_3_18_1</name>
  </enumValues>
  <enumValues>
    <name>пункт_3_18_2</name>
  </enumValues>
  <enumValues>
    <name>пункт_3_18_3</name>
  </enumValues>
  <enumValues>
    <name>пункт_7_1_1</name>
  </enumValues>
  <enumValues>
    <name>пункт_7_1_2</name>
  </enumValues>
  <enumValues>
    <name>пункт_7_1_3</name>
  </enumValues>
  <enumValues>
    <name>пункт_7_1_4</name>
  </enumValues>
  <enumValues>
    <name>пункт_7_1_5</name>
  </enumValues>
  <enumValues>
    <name>пункт_7_1_6</name>
  </enumValues>
  <enumValues>
    <name>пункт_7_9</name>
  </enumValues>
  <enumValues>
    <name>пункт181_6_1_1</name>
  </enumValues>
  <enumValues>
    <name>пункт181_6_1_2</name>
  </enumValues>
  <enumValues>
    <name>пункт181_6_1_3</name>
  </enumValues>
  <enumValues>
    <name>пункт181_6_1_4</name>
  </enumValues>
  <enumValues>
    <name>пункт181_6_1_5</name>
  </enumValues>
  <enumValues>
    <name>пункт181_6_1_6</name>
  </enumValues>
  <enumValues>
    <name>пункт181_6_7</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/РЭЙ_ЗаявлениеВБанкПС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,ОбъектыПечати, ПараметрыВывода) Экспорт
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеВБанкПС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"ЗаявлениеВБанкПС",
//		"Заявление в уполномоченный банк ПС",
		"Заявление в банк УК",
		ПолучитьТабДок(МассивОбъектов));
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТабДок(МассивОбъектов)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ОбъектСсылки = Ссылка.ПолучитьОбъект();
		Если ОбъектСсылки.Дата >= Дата(2018,03,01) Тогда
			Если ОбъектСсылки.ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_17_4_ПредоставлениеВБК Тогда
				ТабличныйДокумент.Вывести(ОбъектСсылки.Печать2018_ЗаявлениеНаПредоставлениеВБК());
			ИначеЕсли ОбъектСсылки.ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_6_1_СнятиеСУчетаКонтракта Тогда
				Если ОбъектСсылки.ОснованиеЗакрытияПС <> Перечисления.РЭЙ_ОснованияЗакрытияПС.пункт181_6_7 Тогда
					ТабличныйДокумент.Вывести(ОбъектСсылки.Печать2018_ЗаявлениеОСнятииСУчетаКонтрактов());
				КонецЕсли;
			ИначеЕсли ОбъектСсылки.ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_7_1_ВнесениеИзмененийВРаздел1ВБК Тогда
				ТабличныйДокумент.Вывести(ОбъектСсылки.Печать2018_ЗаявлениеОВнесенииИзмененийВРаздел1ВБК());
			ИначеЕсли ОбъектСсылки.ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.пункт181_2_25_ИзменениеКодовВидовОпераций Тогда
				ТабличныйДокумент.Вывести(ОбъектСсылки.Печать2018_ЗаявлениеОбИзмененииКодовВидовОпераций());
			КонецЕсли;
		Иначе
			Если ОбъектСсылки.ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ЗакрытиеПаспортаСделки Тогда
				ТабличныйДокумент.Вывести(ОбъектСсылки.Печать2012_ЗаявлениеОЗакрытииПС());
			ИначеЕсли ОбъектСсылки.ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ПредоставлениеВедомостиБанковскогоКонтроля Тогда
				ТабличныйДокумент.Вывести(ОбъектСсылки.Печать2012_ЗаявлениеНаПредоставлениеВедомостиБанковскогоКонтроля());
			ИначеЕсли ОбъектСсылки.ВидОперации = Перечисления.РЭЙ_ВидыОперацийЗаявлениеВБанк.ПереоформлениеПаспортаСделки Тогда
				ТабличныйДокумент.Вывести(ОбъектСсылки.Печать2012_ЗаявлениеОПереоформленииПС());
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаДокумента" И ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;

	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ВыбраннаяФорма = "ФормаДокумента"; 
	КонецЕсли;

	Если Параметры.Свойство("ЗначениеКопирования")
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ВыбраннаяФорма = "ФормаДокумента";
	КонецЕсли;

	Если Параметры.Свойство("ЗначенияЗаполнения") 
		И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда
		Если Параметры.ЗначенияЗаполнения.Свойство("ВидОперации") Тогда
			ВыбраннаяФорма = "ФормаДокумента";
		КонецЕсли;
	КонецЕсли;

	Если Параметры.Свойство("Основание")
		И ЗначениеЗаполнено(Параметры.Основание) Тогда
			ВыбраннаяФорма = "ФормаДокумента";
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	
	Если ВыбраннаяФорма = Неопределено Тогда
		ВыбраннаяФорма = "ФормаВыбораОперации";
	КонецЕсли;

КонецПроцедуры


#Область ПроцедурыИФункцииПечати

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "РЭЙ_СлужебныйКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.РЭЙ_ЗаявлениеВБанкПС";
	КомандаПечати.Идентификатор = "ЗаявлениеВБанкПС";
	КомандаПечати.Представление = НСтр("ru = 'Заявление в банк УК'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
КонецПроцедуры

#КонецОбласти
